MedScheduler/app/views/doctors/analytics.html.erb

SELECT COUNT(*) FROM "patients" INNER JOIN "appointments" ON "patients"."id" = "appointments"."patient_id" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 1]]
SELECT "doctors".* FROM "doctors"
---
<h3>Doctor with the most patients currently: <%= link_to "#{@busiest.name}", doctor_path(@busiest.id) %></h3>
<h4>Number of patients: <%=@busiest.patients.count%></h4>
<h3>Pharmacy with the most Doctors: <%= link_to "#{@busiest_pharm.name}", pharmacy_path(@busiest_pharm.id)%></h3>
<h4>Number of doctors: <%=@busiest_pharm.doctors.count%></h4>