MedScheduler/app/views/doctors/show.html.erb

<h4><%= "Appointments:" %></h4>
<% @doctor.appointments.each do |d| %>
<%= "Patient Name: #{Patient.find(d.patient_id).name}" %><br>
<%= "Date: #{Datetime.find(d.datetime_id).date}" %><br>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 11]]
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "datetimes".* FROM "datetimes" WHERE "datetimes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]