MedScheduler/app/views/patients/show.html.erb

<h4><%= "Appointments:" %></h4>
<% @patient.appointments.each do |d| %>
<%= "Doctor Name: #{Doctor.find(d.doctor_id).name}" %><br>
<%= "Date: #{Datetime.find(d.datetime_id).date}" %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 1]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "datetimes".* FROM "datetimes" WHERE "datetimes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]