MedScheduler/app/views/specialties/index.html.erb

<h2><%= link_to s.name, specialty_path(s)%></h2>
<p>Specialist Count: <%= s.doctors.count %></p>
---
SELECT "doctors".* FROM "doctors"