MedScheduler/app/views/specialties/show.html.erb


<% @specialty.doctors.each do |d| %>
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."specialty_id" = ?  [["specialty_id", 1]]