MedScheduler/app/views/pharmacies/show.html.erb

<h3>Doctors who prescribe here:</h3>
<% @pharmacy.doctors.each do |d| %>
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."pharmacy_id" = ?  [["pharmacy_id", 2]]