MedScheduler/app/controllers/appointments_controller.rb

    def new
        @appointments = Appointment.new
        @doctors = Doctor.all
        @patients = Patient.all
        @datetimes = Datetime.all
---
SELECT "doctors".* FROM "doctors"
SELECT "patients".* FROM "patients"
SELECT "datetimes".* FROM "datetimes"

    def show
        @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @appointment = Appointment.create(appt_params)
        @doctor = Doctor.find(@appointment.doctor_id)
---
INSERT INTO "appointments" ("doctor_id", "patient_id", "created_at", "updated_at", "datetime_id") VALUES (?, ?, ?, ?, ?)  [["doctor_id", 1], ["patient_id", 1], ["created_at", "2021-01-06 00:32:05.388164"], ["updated_at", "2021-01-06 00:32:05.388164"], ["datetime_id", 1]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @appointment = Appointment.find(params[:id])
        @appointment.destroy
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 1]]