MedScheduler/app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @doctor = Doctor.find(params[:id])