MedScheduler/app/controllers/doctors_controller.rb

    def index
        @doctors = Doctor.all
        @specialties = Specialty.all
        @hospitals = Hospital.all
        if params[:search]
            @doctor = Doctor.find_by(name: params[:search])
---
SELECT "doctors".* FROM "doctors"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."name" = ? LIMIT ?  [["name", "Dr. Lavern Grady"], ["LIMIT", 1]]

    def update
        @ratings = @doctor.rating.to_s.split(' ') << params[:rating].to_f
        @doctor.rating = @ratings.sum {|r| r.to_f } / @ratings.length
        @doctor.save
---
UPDATE "doctors" SET "rating" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["rating", 4], ["updated_at", "2021-01-06 16:06:28.012598"], ["id", 2]]

    def current_doctor
        @doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]