MedScheduler/app/controllers/hospitals_controller.rb

SELECT "hospitals".* FROM "hospitals"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 1]]
---
    def index
        @hospitals = Hospital.all
        @doctors = Doctor.all

SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @hospital = Hospital.find(params[:id])