MedScheduler/app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients"
SELECT "hospitals".* FROM "hospitals"
SELECT "specialties".* FROM "specialties"
SELECT "pharmacies".* FROM "pharmacies"
---
    def index
        @patients = Patient.all
        @doctors = Doctor.all
        @oldest = Patient.oldest
        @youngest = Patient.youngest
        @hospitals = Hospital.all
        @specialties = Specialty.all
        @pharmacies = Pharmacy.all