MedScheduler/app/controllers/pharmacies_controller.rb

    def index
        @pharmacies = Pharmacy.all
        @specialties = Specialty.all
        @hospitals = Hospital.all
        @doctors = Doctor.all
        @busiest = Pharmacy.all.max_by{|p| p.doctors.count}
---
SELECT "pharmacies".* FROM "pharmacies"
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."pharmacy_id" = ?  [["pharmacy_id", 1]]

    def show
        @pharmacy = Pharmacy.find(params[:id])
---
SELECT "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]