MedScheduler/app/controllers/specialties_controller.rb

SELECT "specialties".* FROM "specialties"
SELECT "doctors".* FROM "doctors"
---
    def index
        @specialties = Specialty.all
        @doctors = Doctor.all

SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @specialty = Specialty.find(params[:id])