MedScheduler/app/models/doctor.rb

SELECT "doctors".* FROM "doctors"
---
  def self.highest_rated
    Doctor.all.max_by(&:rating)

SELECT COUNT(*) FROM "patients" INNER JOIN "appointments" ON "patients"."id" = "appointments"."patient_id" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 1]]
---
  def self.busiest_doctor
    Doctor.all.max_by {|d| d.patients.count}

SELECT "doctors".* FROM "doctors"
---
  def self.expensive_doctor
    Doctor.all.max_by{|d| d.cost_s}