MedScheduler/app/models/doctor.rb

SELECT "doctors".* FROM "doctors"
---
  def self.search(search)
      if search
        doctor = Doctor.find_by(name: search)
        if doctor
          self.where(doctor_id: doctor)
        else
          @doctors = Doctor.all
        end
      else
        @doctors = Doctor.all