MedScheduler/app/models/hospital.rb

    def self.busiest_hospital
        @busiest = Hospital.all.max_by{|p| p.doctors.count}
---
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 1]]

    def self.slowest_hospital
        @slowest = Hospital.all.min_by{|p|p.doctors.count}
---
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 1]]

    def average_rating_hospital
        sum = self.doctors.map {|d| d.rating}.sum
        if sum != nil && sum != 0
            avg = sum / self.doctors.count
---
SELECT "hospitals".* FROM "hospitals"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 1]]
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 1]]

    def self.highest_rated_hospital
        self.all.max_by {|d| d.average_rating_hospital }
---
SELECT "hospitals".* FROM "hospitals"