MedScheduler/app/models/patient.rb

SELECT "patients".* FROM "patients"
---
    def self.oldest
        Patient.all.max_by{|p| p.age }

SELECT "patients".* FROM "patients"
---
    def self.youngest
        Patient.all.min_by{|p| p.age}