MedScheduler/app/models/pharmacy.rb

    def self.busiest_pharmacy
        @busiest = Pharmacy.all.max_by{|p| p.doctors.count}
---
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."pharmacy_id" = ?  [["pharmacy_id", 1]]

    def self.slowest_pharmacy
        @slowest = Pharmacy.all.min_by{|p|p.doctors.count}
---
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."pharmacy_id" = ?  [["pharmacy_id", 1]]