MedScheduler/app/models/specialty.rb

    def ave_rating
        sum = self.doctors.map {|d| d.rating}.sum
        if sum != nil && sum != 0
            avg = sum / self.doctors.count
---
SELECT "specialties".* FROM "specialties"
SELECT "doctors".* FROM "doctors" WHERE "doctors"."specialty_id" = ?  [["specialty_id", 1]]
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."specialty_id" = ?  [["specialty_id", 1]]

    def self.highest_rating
        self.all.max_by {|d| d.ave_rating }
---
SELECT "specialties".* FROM "specialties"

    def avg_cost
        sum = self.doctors.map {|d| d.cost_s}.sum
        if sum != nil && sum != 0
            avg = sum / self.doctors.count
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."specialty_id" = ?  [["specialty_id", 1]]
SELECT COUNT(*) FROM "doctors" WHERE "doctors"."specialty_id" = ?  [["specialty_id", 1]]

    def self.highest_cost
        self.all.max_by {|d| d.avg_cost }
---
SELECT "specialties".* FROM "specialties"