MedScheduler/app/views/hospitals/show.html.erb

<h3>Doctors who work here:</h3>
<% @hospital.doctors.each do |d| %>
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."hospital_id" = ?  [["hospital_id", 1]]